[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:46:15
 
           <Nav className="me-auto">
             {
-              (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
-                <>
-                  <Nav.Link href="/courses">Courses</Nav.Link>
-                </>
-              )
+              true
             }
           </Nav>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Error: Unable to find an element with the text: Courses. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:46:15
 
           <Nav className="me-auto">
             {
-              (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
-                <>
-                  <Nav.Link href="/courses">Courses</Nav.Link>
-                </>
-              )
+              hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR") || <>
+                  <Nav.Link href="/courses">Courses</Nav.Link>
+                </>
             }
           </Nav>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Error: Unable to find an element with the text: Courses. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:57:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/jobs">Manage Jobs</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                    <NavDropdown.Item href="/admin/jobs">Manage Jobs</NavDropdown.Item>
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
