[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:33:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="CoursesForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:33:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="CoursesForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="CoursesForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, name, school, term, startDate, endDate, githubOrg}). If you meant to render a collection of children, use an array instead.

[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:57:62
                             id="name"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("name", { required: true })}
+                            {...register("name", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:60:30
                             {...register("name", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.name && 'Name is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:60:30
                             {...register("name", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.name && 'Name is required. '}
+                            {errors.name || 'Name is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Name/

Here are the matching elements:

<label
  class="form-label"
  for="name"
>

[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:75:64
                             id="school"
                             type="text"
                             isInvalid={Boolean(errors.school)}
-                            {...register("school", { required: true })}
+                            {...register("school", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:75:52
                             id="school"
                             type="text"
                             isInvalid={Boolean(errors.school)}
-                            {...register("school", { required: true })}
+                            {...register("school", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:78:30
                             {...register("school", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.school && 'School is required. '}
+                            {errors.school || 'School is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:78:30
                             {...register("school", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.school && 'School is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:90:62
                             id="term"
                             type="text"
                             isInvalid={Boolean(errors.term)}
-                            {...register("term", { required: true })}
+                            {...register("term", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:90:50
                             id="term"
                             type="text"
                             isInvalid={Boolean(errors.term)}
-                            {...register("term", { required: true })}
+                            {...register("term", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:93:30
                             {...register("term", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.term && 'Term is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:93:30
                             {...register("term", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.term && 'Term is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:111:30
                             {...register("startDate", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startDate && 'StartDate date is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:111:30
                             {...register("startDate", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startDate && 'StartDate date is required. '}
+                            {errors.startDate || 'StartDate date is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:123:53
                             id="endDate"
                             type="datetime-local"
                             isInvalid={Boolean(errors.endDate)}
-                            {...register("endDate", { required: true, pattern: isodate_regex })}
+                            {...register("endDate", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /EndDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:126:30
                             {...register("endDate", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.endDate && 'EndDate date is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /EndDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:126:30
                             {...register("endDate", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.endDate && 'EndDate date is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /EndDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:141:67
                             id="githubOrg"
                             type="text"
                             isInvalid={Boolean(errors.githubOrg)}
-                            {...register("githubOrg", { required: true })}
+                            {...register("githubOrg", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /GithubOrg is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:144:30
                             {...register("githubOrg", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.githubOrg && 'GithubOrg is required. '}
+                            {errors.githubOrg || 'GithubOrg is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:144:30
                             {...register("githubOrg", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.githubOrg && 'GithubOrg is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /GithubOrg is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
