[Killed] BlockStatement
main/components/Courses/CoursesTable.js:12:37
 
      const navigate = useNavigate();
 
-     const editCallback = (cell) => {
-         navigate(`/courses/edit/${cell.row.values.id}`);
-     };
+     const editCallback = (cell) => {};
 
      // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:45:10
              Header: 'Term',
              accessor: 'term',
          },
-         {
-             Header: 'StartDate',
-             accessor: 'startDate',
-         },
+         {},
          {
              Header: 'EndDate',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:53:10
              Header: 'EndDate',
              accessor: 'endDate',
          },
-         {
-             Header: 'GitHub Org',
-             accessor: 'githubOrg',
-         },
+         {},
      ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:55:24
          },
          {
              Header: 'GitHub Org',
-             accessor: 'githubOrg',
+             accessor: "",
          },
      ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-githubOrg"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:59:89
          },
      ];
 
-     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
-     }
+     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
      return <OurTable
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
