[Killed] BooleanLiteral
main/components/School/SchoolForm.js:34:64
                             id="abbrev"
                             type="text"
                             isInvalid={Boolean(errors.abbrev)}
-                            {...register("abbrev", { required: true, pattern: abbrev_regex })}
+                            {...register("abbrev", { required: false, pattern: abbrev_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Abbreviation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/School/SchoolForm.js:37:30
                             {...register("abbrev", { required: true, pattern: abbrev_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
+                            {errors.abbrev?.type === 'required' || 'Abbreviation is required. '}
                             {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
                         </Form.Control.Feedback>
killedBy: SchoolForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Abbreviation/

Here are the matching elements:

<label
  class="form-label"
  for="abbrev"
>

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:37:30
                             {...register("abbrev", { required: true, pattern: abbrev_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
+                            {true}
                             {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
                         </Form.Control.Feedback>
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Abbreviation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/School/SchoolForm.js:38:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
-                            {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
+                            {errors.abbrev?.type !== 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Abbreviation/

Here are the matching elements:

<label
  class="form-label"
  for="abbrev"
>

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:38:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
-                            {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Abbreviation must be lowercase letters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:53:30
                             {...register("name", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.name && 'Name is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/School/SchoolForm.js:65:67
                             id="termRegex"
                             type="text"
                             isInvalid={Boolean(errors.termRegex)}
-                            {...register("termRegex", { required: true })}
+                            {...register("termRegex", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Regex is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/School/SchoolForm.js:65:55
                             id="termRegex"
                             type="text"
                             isInvalid={Boolean(errors.termRegex)}
-                            {...register("termRegex", { required: true })}
+                            {...register("termRegex", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Regex is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/School/SchoolForm.js:68:30
                             {...register("termRegex", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termRegex && 'Term Regex is required. '}
+                            {errors.termRegex || 'Term Regex is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:68:30
                             {...register("termRegex", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termRegex && 'Term Regex is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Regex is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/School/SchoolForm.js:83:73
                             id="termDescription"
                             type="text"
                             isInvalid={Boolean(errors.termDescription)}
-                            {...register("termDescription", { required: true})}
+                            {...register("termDescription", { required: false})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Description is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/School/SchoolForm.js:83:42
                             id="termDescription"
                             type="text"
                             isInvalid={Boolean(errors.termDescription)}
-                            {...register("termDescription", { required: true})}
+                            {...register("", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:86:30
                             {...register("termDescription", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termDescription && 'Term Description is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Description is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:86:30
                             {...register("termDescription", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termDescription && 'Term Description is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Description is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/School/SchoolForm.js:101:67
                             id="termError"
                             type="text"
                             isInvalid={Boolean(errors.termError)}
-                            {...register("termError", { required: true})}
+                            {...register("termError", { required: false})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Error is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:104:30
                             {...register("termError", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termError && 'Term Error is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Error is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:104:30
                             {...register("termError", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termError && 'Term Error is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Error is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
