[Killed] ArrowFunction
src/main/pages/CoursesCreatePage.js:9:33
 
 export default function CoursesCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (course) => ({
-        url: "/api/courses/post",
-        method: "POST",
-        params: {
-        name: course.name,
-        school: course.school,
-        term: course.term,
-        startDate: course.startDate,
-        endDate: course.endDate,
-        githubOrg: course.githubOrg
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (course) => {
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/CoursesCreatePage.js:12:17
     const objectToAxiosParams = (course) => ({
         url: "/api/courses/post",
         method: "POST",
-        params: {
-        name: course.name,
-        school: course.school,
-        term: course.term,
-        startDate: course.startDate,
-        endDate: course.endDate,
-        githubOrg: course.githubOrg
-        }
+        params: {}
     });
 
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "endDate": "2023-12-15T12:00",
-   "githubOrg": "ucsb-cs156-f23",

[Killed] BlockStatement
src/main/pages/CoursesCreatePage.js:22:35
         }
     });
 
-    const onSuccess = (course) => {
-        toast(`New course created - id: ${course.id}`);
-    }
+    const onSuccess = (course) => {}
 
     const mutation = useBackendMutation(
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course created - id: 1"

Number of calls: 0

[Killed] StringLiteral
src/main/pages/CoursesCreatePage.js:23:15
     });
 
     const onSuccess = (course) => {
-        toast(`New course created - id: ${course.id}`);
+        toast(``);
     }
 
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course created - id: 1"
Received: ""

Number of calls: 1
