[Killed] StringLiteral
src/main/pages/CoursesEditPage.js:17:14
       [`/api/courses?id=${id}`],
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
-        url: `/api/courses/get`,
+        url: ``,
         params: {
           id
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CoursesForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/CoursesEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses/update",
-    method: "PUT",
-    params: {
-      id: course.id,
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/CoursesEditPage.js:28:13
   const objectToAxiosPutParams = (course) => ({
     url: "/api/courses/update",
     method: "PUT",
-    params: {
-      id: course.id,
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    },
+    params: {},
   });
 
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "endDate": "2023-03-12T00:00",
-   "githubOrg": "ucsb-cs156-w23",

[Killed] BlockStatement
src/main/pages/CoursesEditPage.js:39:33
     },
   });
 
-  const onSuccess = (course) => {
-    toast(`Course Updated - id: ${course.id} name: ${course.name}`);
-  }
+  const onSuccess = (course) => {}
 
   const mutation = useBackendMutation(
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
src/main/pages/CoursesEditPage.js:65:11
       <div className="pt-2">
         <h1>Edit Course</h1>
         {
-          course && <CoursesForm initialContents={course} submitAction={onSubmit} buttonLabel="Update" />
+          course || <CoursesForm initialContents={course} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: CoursesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="CoursesForm-name" id="name" name="name" type="text" /> instead

[Killed] ConditionalExpression
src/main/pages/CoursesEditPage.js:65:11
       <div className="pt-2">
         <h1>Edit Course</h1>
         {
-          course && <CoursesForm initialContents={course} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CoursesForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
