[Killed] StringLiteral
main/components/Courses/CourseTable.js:13:19
      const navigate = useNavigate();
 
      const editCallback = (cell) => {
-         navigate(`/course/edit/${cell.row.values.id}`);
+         navigate(``);
      };
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/course/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Courses/CourseTable.js:60:36
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "CourseTable"));
+         columns.push(ButtonColumn("", "primary", editCallback, "CourseTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CourseTable"));
      }
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
