[Killed] StringLiteral
main/components/Schools/SchoolsEditForm.js:5:69
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom'
 
-function SchoolsForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function SchoolsForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: SchoolsEditForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Schools/SchoolsEditForm.js:23:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
             <Row>
-                {initialContents && (
-                <Col>
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="abbrev">Abbreviation</Form.Label>
-                        <Form.Control
-                            data-testid="SchoolsForm-abbrev"
-                            id="abbrev"
-                            type="text"
-                            {...register("abbrev")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-                </Col>
-                )}
+                {false}
                 <Col>
                     <Form.Group className="mb-3" >
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolsForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/Schools/SchoolsEditForm.js:23:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
             <Row>
-                {initialContents && (
-                <Col>
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="abbrev">Abbreviation</Form.Label>
-                        <Form.Control
-                            data-testid="SchoolsForm-abbrev"
-                            id="abbrev"
-                            type="text"
-                            {...register("abbrev")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-                </Col>
-                )}
+                {initialContents || <Col>
+                    <Form.Group className="mb-3">
+                        <Form.Label htmlFor="abbrev">Abbreviation</Form.Label>
+                        <Form.Control data-testid="SchoolsForm-abbrev" id="abbrev" type="text" {...register("abbrev")} value={initialContents.id} disabled />
+                    </Form.Group>
+                </Col>}
                 <Col>
                     <Form.Group className="mb-3" >
killedBy: SchoolsEditForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/Schools/SchoolsEditForm.js:31:42
                             data-testid="SchoolsForm-abbrev"
                             id="abbrev"
                             type="text"
-                            {...register("abbrev")}
+                            {...register("")}
                             value={initialContents.id}
                             disabled
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Schools/SchoolsEditForm.js:46:50
                             id="name"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("name", { required: true })}
+                            {...register("name", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolsEditForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Schools/SchoolsEditForm.js:64:30
                             {...register("termRegex", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termRegex && 'Term Regex is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolsEditForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Regex is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Schools/SchoolsEditForm.js:82:30
                             {...register("termDescription", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termDescription && 'Term Description is required.'}
+                            {errors.termDescription || 'Term Description is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolsEditForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ObjectLiteral
main/components/Schools/SchoolsEditForm.js:97:55
                             id="termError"
                             type="text"
                             isInvalid={Boolean(errors.termError)}
-                            {...register("termError", { required: true})}
+                            {...register("termError", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolsEditForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Error is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
