[Killed] ConditionalExpression
main/components/Schools/SchoolsForm.js:37:30
                             {...register("abbrev", { required: true, pattern: abbrev_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
+                            {false}
                             {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
                         </Form.Control.Feedback>
killedBy: SchoolsForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Abbreviation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/Schools/SchoolsForm.js:37:30
                             {...register("abbrev", { required: true, pattern: abbrev_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
+                            {errors.abbrev?.type !== 'required' && 'Abbreviation is required. '}
                             {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
                         </Form.Control.Feedback>
killedBy: SchoolsForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Abbreviation/

Here are the matching elements:

<label
  class="form-label"
  for="abbrev"
>

[Killed] ConditionalExpression
main/components/Schools/SchoolsForm.js:38:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
-                            {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolsForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Abbreviation must be lowercase letters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Schools/SchoolsForm.js:38:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
-                            {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
+                            {errors.abbrev.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] StringLiteral
main/components/Schools/SchoolsForm.js:50:42
                             id="name"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("name", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Schools/SchoolsForm.js:83:61
                             id="termDescription"
                             type="text"
                             isInvalid={Boolean(errors.termDescription)}
-                            {...register("termDescription", { required: true})}
+                            {...register("termDescription", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: SchoolsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term Description is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
