[Killed] BlockStatement
main/components/Schools/SchoolsTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/Schools/edit/${cell.row.values.abbrev}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: SchoolsTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/Schools/edit/ucsb"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Schools/SchoolsTable.js:34:21
 
     const columns = [
         {
-            Header: 'Abbreviation',
+            Header: "",
             accessor: 'abbrev', // accessor is the "key" in the data
         },
killedBy: SchoolsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Abbreviation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: bloc

[Killed] StringLiteral
main/components/Schools/SchoolsTable.js:35:23
     const columns = [
         {
             Header: 'Abbreviation',
-            accessor: 'abbrev', // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
         },
 
killedBy: SchoolsIndexPage tests renders three schools correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="SchoolsTable-cell-row-0-col-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/Schools/SchoolsTable.js:50:9
             Header: 'Term Description',
             accessor: 'termDescription',
         },
-        {
-            Header: 'Term Error',
-            accessor: 'termError',
-        }
+        {}
     ];
 
killedBy: SchoolsIndexPage tests renders empty table when backend unavailable
statusReason: Error: A column ID (or string accessor) is required!
