[Killed] BooleanLiteral
main/pages/Schools/SchoolsCreatePage.js:7:54
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function SchoolsCreatePage({storybook=false}) {
+export default function SchoolsCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (schools) => ({
killedBy: SchoolsCreatePage tests on submit, makes request to backend, and redirects to /Schools
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/Schools"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Schools/SchoolsCreatePage.js:9:31
 
 export default function SchoolsCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (schools) => ({
-    url: "/api/Schools/post",
-    method: "POST",
-    params: {
-     abbrev: schools.abbrev,
-     name: schools.name,
-     termRegex: schools.termRegex,
-     termDescription: schools.termDescription,
-     termError: schools.termError
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (schools) => {
killedBy: SchoolsCreatePage tests on submit, makes request to backend, and redirects to /Schools
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Schools/SchoolsCreatePage.js:10:10
 export default function SchoolsCreatePage({storybook=false}) {
 
   const objectToAxiosParams = (schools) => ({
-    url: "/api/Schools/post",
+    url: "",
     method: "POST",
     params: {
killedBy: SchoolsCreatePage tests on submit, makes request to backend, and redirects to /Schools
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New school created - abbrev: ucla"

Number of calls: 0

[Killed] StringLiteral
main/pages/Schools/SchoolsCreatePage.js:11:13
 
   const objectToAxiosParams = (schools) => ({
     url: "/api/Schools/post",
-    method: "POST",
+    method: "",
     params: {
      abbrev: schools.abbrev,
killedBy: SchoolsCreatePage tests on submit, makes request to backend, and redirects to /Schools
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Schools/SchoolsCreatePage.js:21:34
     }
   });
 
-  const onSuccess = (schools) => {
-    toast(`New school created - abbrev: ${schools.abbrev}`);
-  }
+  const onSuccess = (schools) => {}
 
   const mutation = useBackendMutation(
killedBy: SchoolsCreatePage tests on submit, makes request to backend, and redirects to /Schools
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New school created - abbrev: ucla"

Number of calls: 0

[Killed] BlockStatement
main/pages/Schools/SchoolsCreatePage.js:38:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/Schools" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: SchoolsCreatePage tests on submit, makes request to backend, and redirects to /Schools
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/Schools"}

Number of calls: 0
