[Killed] BooleanLiteral
main/pages/Schools/SchoolsEditPage.js:8:52
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function SchoolsEditPage({storybook=false}) {
+export default function SchoolsEditPage({storybook=true}) {
     let { abbrev } = useParams();
 
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/Schools"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Schools/SchoolsEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/Schools?abbrev=${abbrev}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/Schools`,
-                params: {
-                    abbrev
-                }
-            }
+            {}
         );
 
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolsForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Schools/SchoolsEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (school) => ({
-        url: "/api/Schools",
-        method: "PUT",
-        params: {
-            abbrev: school.abbrev,
-        },
-        data: {
-            name: school.name,
-            termRegex: school.termRegex,
-            termDescription: school.termDescription,
-            termError: school.termError
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (school) => {
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Schools/SchoolsEditPage.js:27:17
     const objectToAxiosPutParams = (school) => ({
         url: "/api/Schools",
         method: "PUT",
-        params: {
-            abbrev: school.abbrev,
-        },
+        params: {},
         data: {
             name: school.name,
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "abbrev": "ucsb",
- }

[Killed] ObjectLiteral
main/pages/Schools/SchoolsEditPage.js:30:15
         params: {
             abbrev: school.abbrev,
         },
-        data: {
-            name: school.name,
-            termRegex: school.termRegex,
-            termDescription: school.termDescription,
-            termError: school.termError
-        }
+        data: {}
     });
 
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"name\":\"UC Santa Barbie\",\"termRegex\":\"[FS]\\\\d\\\\d\",\"termDescription\":\"Enter semester, e.g. F23, S24\",\"termError\":\"Semester must be entered in the correct format\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/Schools/SchoolsEditPage.js:38:35
         }
     });
 
-    const onSuccess = (school) => {
-        toast(`School Updated - abbrev: ${school.abbrev} name: ${school.name}`);
-    }
+    const onSuccess = (school) => {}
 
     const mutation = useBackendMutation(
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Schools/SchoolsEditPage.js:39:15
     });
 
     const onSuccess = (school) => {
-        toast(`School Updated - abbrev: ${school.abbrev} name: ${school.name}`);
+        toast(``);
     }
 
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School Updated - abbrev: ucsb name: UC Santa Barbie"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/Schools/SchoolsEditPage.js:64:21
             <div className="pt-2">
                 <h1>Edit School</h1>
                 {
-                    schools && <SchoolsEditForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={schools} />
+                    true
                 }
             </div>
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolsForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Schools/SchoolsEditPage.js:64:21
             <div className="pt-2">
                 <h1>Edit School</h1>
                 {
-                    schools && <SchoolsEditForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={schools} />
+                    false
                 }
             </div>
killedBy: SchoolsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolsForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
