[Killed] BlockStatement
src/main/utils/SchoolsUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/Schools",
-        method: "DELETE",
-        params: {
-            abbrev: cell.row.values.abbrev
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
killedBy: SchoolsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev ucsb was deleted"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/SchoolsUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/Schools",
-        method: "DELETE",
-        params: {
-            abbrev: cell.row.values.abbrev
-        }
-    }
+    return {}
 }
killedBy: SchoolsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev ucsb was deleted"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
src/main/utils/SchoolsUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/Schools",
+        url: "",
         method: "DELETE",
         params: {
killedBy: SchoolsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev ucsb was deleted"

Number of calls: 0

<html>
  <head />
