[Killed] BlockStatement
main/components/Courses/CourseTable.js:12:37
 
     const navigate = useNavigate();
 
-    const staffCallback = (cell) => {
-    navigate(`/course/${cell.row.values.id}/staff`);
-};
+    const staffCallback = (cell) => {};
 
     const editCallback = (cell) => {
killedBy: UserTable tests Staff button navigates to the staff page for ordinary user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/course/1/staff"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Courses/CourseTable.js:16:36
     navigate(`/course/${cell.row.values.id}/staff`);
 };
 
-    const editCallback = (cell) => {
-        navigate(`/course/edit/${cell.row.values.id}`);
-    };
+    const editCallback = (cell) => {};
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/course/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CourseTable.js:63:66
         },
     ];
 
-    columns.push(ButtonColumn("Staff", "primary", staffCallback, "CourseTable"));
+    columns.push(ButtonColumn("Staff", "primary", staffCallback, ""));
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-Staff-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Courses/CourseTable.js:65:88
 
     columns.push(ButtonColumn("Staff", "primary", staffCallback, "CourseTable"));
 
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "CourseTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CourseTable"));
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
     return <OurTable
killedBy: CourseIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/CourseTable.js:67:71
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "CourseTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CourseTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
