[Killed] StringLiteral
main/components/Courses/StaffForm.js:6:67
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom'
 
-function StaffForm({ initialContents, submitAction, buttonLabel = "Add", courseId }) {
+function StaffForm({ initialContents, submitAction, buttonLabel = "", courseId }) {
 
     // Stryker disable all
killedBy: StaffForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Add/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/StaffForm.js:28:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="StaffForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: StaffForm tests renders correctly when passing in a staff
statusReason: Error: Unable to find an element by: [data-testid="/StaffForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/StaffForm.js:28:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="StaffForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: StaffForm tests renders correctly when passing in a staff
statusReason: Error: Unable to find an element by: [data-testid="/StaffForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/StaffForm.js:51:42
                             data-testid="StaffForm-courseId"
                             id="courseId"
                             type="text"
-                            {...register("courseId")}
+                            {...register("")}
                             value={courseId}
                             readOnly
killedBy: StaffForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/Courses/StaffForm.js:66:69
                             id="githubLogin"
                             type="text"
                             isInvalid={Boolean(errors.githubLogin)}
-                            {...register("githubLogin", { required: true })}
+                            {...register("githubLogin", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: StaffForm tests Correct Error messsages on missing input
statusReason: TypeError: e is not a function

[Killed] StringLiteral
main/components/Courses/StaffForm.js:66:42
                             id="githubLogin"
                             type="text"
                             isInvalid={Boolean(errors.githubLogin)}
-                            {...register("githubLogin", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: StaffForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] LogicalOperator
main/components/Courses/StaffForm.js:69:30
                             {...register("githubLogin", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.githubLogin && 'Github Login is required. '}
+                            {errors.githubLogin || 'Github Login is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: StaffForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Github Login/

Here are the matching elements:

<label
  class="form-label"
  for="githubLogin"
>

[Killed] ConditionalExpression
main/components/Courses/StaffForm.js:69:30
                             {...register("githubLogin", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.githubLogin && 'Github Login is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: StaffForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Github Login is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
