[Killed] ObjectLiteral
main/components/Courses/StaffTable.js:31:9
             Header: 'id',
             accessor: 'id',
         },
-        {
-            Header: 'Course ID',
-            accessor: 'courseId',
-        },
+        {},
         {
             Header: 'Github ID',
killedBy: StaffIndexPage tests Renders with Add Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/StaffTable.js:36:21
             accessor: 'courseId',
         },
         {
-            Header: 'Github ID',
+            Header: "",
             accessor: 'githubId',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Github ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] StringLiteral
main/components/Courses/StaffTable.js:37:23
         },
         {
             Header: 'Github ID',
-            accessor: 'githubId',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StaffTable-cell-row-0-col-githubId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Courses/StaffTable.js:43:9
             Header: 'Github Login',
             accessor: 'user.githubLogin',
         },
-        {
-            Header: 'Full Name',
-            accessor: 'user.fullName',
-        },
+        {},
         {
             Header: 'Admin',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/StaffTable.js:45:23
         },
         {
             Header: 'Full Name',
-            accessor: 'user.fullName',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StaffTable-cell-row-0-col-user.fullName"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
main/components/Courses/StaffTable.js:50:19
         {
             Header: 'Admin',
             accessor: 'user.admin',
-            Cell: ({ value }) => value ? "Yes" : "No"
+            Cell: () => undefined
         },
         {
killedBy: StaffIndexPage tests renders three staffs correctly for admin
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Courses/StaffTable.js:50:42
         {
             Header: 'Admin',
             accessor: 'user.admin',
-            Cell: ({ value }) => value ? "Yes" : "No"
+            Cell: ({ value }) => value ? "" : "No"
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] ArrowFunction
main/components/Courses/StaffTable.js:55:19
         {
             Header: 'Instructor',
             accessor: 'user.instructor',
-            Cell: ({ value }) => value ? "Yes" : "No"
+            Cell: () => undefined
         },
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/components/Courses/StaffTable.js:59:88
         },
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StaffTable"));
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
     return <OurTable
killedBy: StaffIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StaffTable-cell-row-2-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/StaffTable.js:60:71
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StaffTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     }
 
killedBy: StaffIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StaffTable-cell-row-2-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/StaffTable.js:60:45
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StaffTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "StaffTable"));
     }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
