[Killed] ArrowFunction
src/main/pages/CourseCreatePage.js:9:33
 
 export default function CourseCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (course) => ({
-        url: "/api/course/create",
-        method: "POST",
-        params: {
-        name: course.name,
-        school: course.school,
-        term: course.term,
-        startDate: course.startDate,
-        endDate: course.endDate,
-        githubOrg: course.githubOrg
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (course) => {
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/CourseCreatePage.js:9:46
 
 export default function CourseCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (course) => ({
-        url: "/api/course/create",
-        method: "POST",
-        params: {
-        name: course.name,
-        school: course.school,
-        term: course.term,
-        startDate: course.startDate,
-        endDate: course.endDate,
-        githubOrg: course.githubOrg
-        }
-    });
+    const objectToAxiosParams = (course) => ({});
 
     const onSuccess = (course) => {
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/CourseCreatePage.js:39:34
         mutation.mutate(data);
     }
 
-    if (isSuccess && !storybook) {
-        return <Navigate to="/course" />
-    }
+    if (isSuccess && !storybook) {}
 
     return (
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/course"}

Number of calls: 0
