[Killed] BooleanLiteral
src/main/pages/CourseEditPage.js:8:51
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function CourseEditPage({storybook=false}) {
+export default function CourseEditPage({storybook=true}) {
   let { id } = useParams();
 
killedBy: CourseEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/course"}

Number of calls: 0

[Killed] StringLiteral
src/main/pages/CourseEditPage.js:17:14
       [`/api/course?id=${id}`],
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
-        url: `/api/course/get`,
+        url: ``,
         params: {
           id
killedBy: CourseEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CourseForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/CourseEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/course/update",
-    method: "PUT",
-    params: {
-      id: course.id,
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CourseEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/CourseEditPage.js:27:13
 
   const objectToAxiosPutParams = (course) => ({
     url: "/api/course/update",
-    method: "PUT",
+    method: "",
     params: {
       id: course.id,
killedBy: CourseEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/pages/CourseEditPage.js:65:11
       <div className="pt-2">
         <h1>Edit Course</h1>
         {
-          course && <CourseForm initialContents={course} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: CourseEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CourseForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
