[Killed] BlockStatement
src/main/pages/CourseIndexPage.js:13:30
 
   const { data: currentUser } = useCurrentUser();
 
-  const createButton = () => {  
-    
-      return (
-          <Button
-              variant="primary"
-              href="/course/create"
-              style={{ float: "right" }}
-          >
-              Create Course 
-          </Button>
-      )
-    
-  }
+  const createButton = () => {}
   
   const { data: courses, error: _error, status: _status } =
killedBy: CourseIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/CourseIndexPage.js:19:31
           <Button
               variant="primary"
               href="/course/create"
-              style={{ float: "right" }}
+              style={{ float: "" }}
           >
               Create Course 
killedBy: CourseIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
