[Killed] ArrowFunction
src/main/pages/StaffCreatePage.js:11:33
 export default function StaffCreatePage({storybook=false}) {
     let { courseId } = useParams();
 
-    const objectToAxiosParams = (staff) => ({
-        url: "/api/course/staff/create",
-        method: "POST",
-        params: {
-        courseId: staff.courseId,
-        githubLogin: staff.githubLogin,
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (staff) => {
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/StaffCreatePage.js:11:45
 export default function StaffCreatePage({storybook=false}) {
     let { courseId } = useParams();
 
-    const objectToAxiosParams = (staff) => ({
-        url: "/api/course/staff/create",
-        method: "POST",
-        params: {
-        courseId: staff.courseId,
-        githubLogin: staff.githubLogin,
-        }
-    });
+    const objectToAxiosParams = (staff) => ({});
 
     const onSuccess = (staff) => {
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/StaffCreatePage.js:20:34
         }
     });
 
-    const onSuccess = (staff) => {
-        toast(`New staff added - id: ${staff.id}`);
-    }
+    const onSuccess = (staff) => {}
 
     const mutation = useBackendMutation(
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New staff added - id: 3"

Number of calls: 0

[Killed] StringLiteral
src/main/pages/StaffCreatePage.js:38:30
     }
 
     if (isSuccess && !storybook) {
-        return <Navigate to={`/course/${courseId}/staff`} />
+        return <Navigate to={``} />
     }
 
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

  Object {
-   "to": "/course/1/staff",
+   "to": "",
