[Killed] BlockStatement
src/main/pages/StaffIndexPage.js:14:30
 
   const { data: currentUser } = useCurrentUser();
 
-  const createButton = () => {  
-    
-      return (
-          <Button
-              variant="primary"
-              href={`/course/${courseId}/staff/create`}
-              style={{ float: "right" }}
-          >
-              Add Staff Member
-          </Button>
-      )
-    
-  }
+  const createButton = () => {}
   
   const { data: staffs, error: _error, status: _status } =
killedBy: StaffIndexPage tests Renders with Add Button for admin user
statusReason: Error: Unable to find an element with the text: /Add Staff Member/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/StaffIndexPage.js:20:22
           <Button
               variant="primary"
               href={`/course/${courseId}/staff/create`}
-              style={{ float: "right" }}
+              style={{}}
           >
               Add Staff Member
killedBy: StaffIndexPage tests Renders with Add Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] StringLiteral
src/main/pages/StaffIndexPage.js:20:31
           <Button
               variant="primary"
               href={`/course/${courseId}/staff/create`}
-              style={{ float: "right" }}
+              style={{ float: "" }}
           >
               Add Staff Member
killedBy: StaffIndexPage tests Renders with Add Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
src/main/pages/StaffIndexPage.js:32:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/course/staff/all?courseId=${courseId}`],
-      {   // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET", 
-        url: `/api/course/staff/all`,
-        params: {
-          courseId: courseId
-        } 
-      },
+      {},
       []
     );
killedBy: StaffIndexPage tests renders three staffs correctly for admin
statusReason: Error: Unable to find an element by: [data-testid="StaffTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
