[Killed] BlockStatement
main/components/Utils/CourseUtils.js:8:48
      toast(message);
  }
 
- export function cellToAxiosParamsDelete(cell) {
-     return {
-         url: "/api/course/delete",
-         method: "DELETE",
-         params: {
-             id: cell.row.values.id
-         }
-     }
-}
+ export function cellToAxiosParamsDelete(cell) {}
killedBy: CourseIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Utils/CourseUtils.js:9:13
  }
 
  export function cellToAxiosParamsDelete(cell) {
-     return {
-         url: "/api/course/delete",
-         method: "DELETE",
-         params: {
-             id: cell.row.values.id
-         }
-     }
+     return {}
 }
killedBy: CourseIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Utils/CourseUtils.js:10:15
 
  export function cellToAxiosParamsDelete(cell) {
      return {
-         url: "/api/course/delete",
+         url: "",
          method: "DELETE",
          params: {
killedBy: CourseIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course with id 1 was deleted"

Number of calls: 0

<html>
  <head />
