[Killed] BlockStatement
main/components/Utils/StaffUtils.js:8:48
      toast(message);
  }
 
- export function cellToAxiosParamsDelete(cell) {
-     return {
-         url: "/api/course/staff",
-         method: "DELETE",
-         params: {
-             id: cell.row.values.id
-         }
-     }
-}
+ export function cellToAxiosParamsDelete(cell) {}
killedBy: StaffIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Staff with id 3 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Utils/StaffUtils.js:11:18
  export function cellToAxiosParamsDelete(cell) {
      return {
          url: "/api/course/staff",
-         method: "DELETE",
+         method: "",
          params: {
              id: cell.row.values.id
killedBy: StaffIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Staff with id 3 was deleted"

Number of calls: 0

<html>
  <head />
