[Survived] ArrayDeclaration
main/components/Courses/CoursesForm.js:20:9
         ["/api/Schools/all"],
         // Stryker disable next-line all : GET is the default
         { method: "GET", url: "/api/Schools/all" },
-        []
+        ["Stryker was here"]
         );
     

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:37:8
 
     let initialSchool = null;
 
-    if(initialContents){
+    if(true){
         initialSchool = initialContents.school;
     }
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'school')

[Survived] BlockStatement
main/components/Courses/CoursesForm.js:37:24
 
     let initialSchool = null;
 
-    if(initialContents){
-        initialSchool = initialContents.school;
-    }
+    if(initialContents){}
 
     // Stryker disable next-line Regex

[Survived] BlockStatement
main/components/Courses/CoursesForm.js:84:54
 
             <Row>
                 <Col>
-        <Form.Group className="mb-3" onChange={() => {
-            setActiveSchool(document.getElementById("FormSelect").value)
-            }}>
+        <Form.Group className="mb-3" onChange={() => {}}>
             <Form.Label htmlForm="school">School</Form.Label>
             <Form.Control

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:85:53
             <Row>
                 <Col>
         <Form.Group className="mb-3" onChange={() => {
-            setActiveSchool(document.getElementById("FormSelect").value)
+            setActiveSchool(document.getElementById("").value)
             }}>
             <Form.Label htmlForm="school">School</Form.Label>
killedBy: CoursesForm tests No Error messsages on good input
statusReason: TypeError: Cannot read properties of null (reading 'value')

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:93:27
                 data-testid = "CoursesForm-school"
                 // behavior is buggy, may just be storybook
                 // only updates after textbox is selected
-                value = { activeSchool || initialSchool }
+                value = { true }
                 type = "text"
                 {...register("school", { required: true })}
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(ucsb)

Expected the element to have value:
  ucsb
Received:
  true

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:93:27
                 data-testid = "CoursesForm-school"
                 // behavior is buggy, may just be storybook
                 // only updates after textbox is selected
-                value = { activeSchool || initialSchool }
+                value = { false }
                 type = "text"
                 {...register("school", { required: true })}
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(ucsb)

Expected the element to have value:
  ucsb
Received:
  false

[Survived] BooleanLiteral
main/components/Courses/CoursesForm.js:95:52
                 // only updates after textbox is selected
                 value = { activeSchool || initialSchool }
                 type = "text"
-                {...register("school", { required: true })}
+                {...register("school", { required: false })}
             >
             </Form.Control>

[Survived] ObjectLiteral
main/components/Courses/CoursesForm.js:95:40
                 // only updates after textbox is selected
                 value = { activeSchool || initialSchool }
                 type = "text"
-                {...register("school", { required: true })}
+                {...register("school", {})}
             >
             </Form.Control>
