[Killed] ConditionalExpression
main/components/Schools/SchoolsDropdown.js:12:8
 
     let initialSchool = null;
 
-    if(initialContents){
+    if(false){
         initialSchool = initialContents.school;
     }
killedBy: SchoolsDropdown tests renders correctly when passing in three schools
statusReason: Error: expect(element).toHaveValue(ucsb)

Expected the element to have value:
  ucsb
Received:
  No school selected

[Killed] ConditionalExpression
main/components/Schools/SchoolsDropdown.js:18:8
 
     let schoolOptions = null;
 
-    if(schools){
+    if(false){
         schoolOptions = schools.map((school) => 
             <option 
killedBy: SchoolsDropdown tests renders correctly when passing in three schools
statusReason: Error: Unable to find an element by: [data-testid="FormSelect-option-ucsb"]

<body>
  <div>
    <select
      class="form-select"
      data-testid="FormSelect"
      id="FormSelect"

[Killed] ConditionalExpression
main/components/Schools/SchoolsDropdown.js:18:8
 
     let schoolOptions = null;
 
-    if(schools){
+    if(true){
         schoolOptions = schools.map((school) => 
             <option 
killedBy: SchoolsDropdown tests renders correctly with no schools
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
main/components/Schools/SchoolsDropdown.js:19:37
     let schoolOptions = null;
 
     if(schools){
-        schoolOptions = schools.map((school) => 
-            <option 
-                key = {school.abbrev}
-                data-testid={`${testId}-option-${school.abbrev}`}
-            > 
-                {school.abbrev} 
-            </option>);
+        schoolOptions = schools.map(() => undefined);
     }
 
killedBy: SchoolsDropdown tests renders correctly when passing in three schools
statusReason: Error: Unable to find an element by: [data-testid="FormSelect-option-ucsb"]

<body>
  <div>
    <select
      class="form-select"
      data-testid="FormSelect"
      id="FormSelect"

[Killed] ConditionalExpression
main/components/Schools/SchoolsDropdown.js:33:23
         <Form.Select 
             id = "FormSelect"
             data-testid = "FormSelect"
-            value = { isActive || initialSchool || "No school selected" } 
+            value = { true } 
             onChange = { option => setIsActive(option.target.value)} 
             >
killedBy: SchoolsDropdown tests that you can select an option
statusReason: Error: expect(element).toHaveValue(No school selected)

Expected the element to have value:
  No school selected
Received:
  ucsb

[Killed] LogicalOperator
main/components/Schools/SchoolsDropdown.js:33:23
         <Form.Select 
             id = "FormSelect"
             data-testid = "FormSelect"
-            value = { isActive || initialSchool || "No school selected" } 
+            value = { (isActive || initialSchool) && "No school selected" } 
             onChange = { option => setIsActive(option.target.value)} 
             >
killedBy: SchoolsDropdown tests renders correctly when passing in three schools
statusReason: Error: expect(element).toHaveValue(ucsb)

Expected the element to have value:
  ucsb
Received:
  No school selected

[Killed] ArrowFunction
main/components/Schools/SchoolsDropdown.js:34:26
             id = "FormSelect"
             data-testid = "FormSelect"
             value = { isActive || initialSchool || "No school selected" } 
-            onChange = { option => setIsActive(option.target.value)} 
+            onChange = { () => undefined} 
             >
             <option 
killedBy: SchoolsDropdown tests that you can select an option
statusReason: Error: expect(element).toHaveValue(ucsb)

Expected the element to have value:
  ucsb
Received:
  No school selected

[Killed] BooleanLiteral
main/components/Schools/SchoolsDropdown.js:38:29
             >
             <option 
                 key = "No school selected"
-                disabled = {true}
+                disabled = {false}
                 data-testid={`${testId}-option-No school selected`}
             >
killedBy: SchoolsDropdown tests that you can select an option
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <option data-testid="FormSelect-option-No school selected" />
